<a href="https://colab.research.google.com/github/AleR26/ColabFiles/blob/main/Practica14.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Práctica #14: Limpieza y Transformación de Datos Categóricos

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [49]:
import pandas as pd

df = pd.read_csv('/content/drive/MyDrive/ClassFiles/nls97.csv')

Ejercicio 01: Errores Tipográficos y Valores Inconsistentes: maritalstatus

In [50]:
print("Valores unicos")
print(df['maritalstatus'].unique())

Valores unicos
['Married' 'Never-married' nan 'Divorced' 'Separated' 'Widowed']

In [51]:
print("Frecuencia de cada valor unico")
print(df['maritalstatus'].value_counts())

Frecuencia de cada valor unico
maritalstatus
Married          3066
Never-married    2766
Divorced          663
Separated         154
Widowed            23
Name: count, dtype: int64

In [52]:
df['maritalstatus'] = df['maritalstatus'].replace({'Never-married':'Single'})
df['maritalstatus'].value_counts()

maritalstatus
Married      3066
Single       2766
Divorced      663
Separated     154
Widowed        23
Name: count, dtype: int64

Ejercicio 02: Errores Tipográficos y Valores Inconsistentes: highestdegree.

In [53]:
print('Valores unicos')
print(df['highestdegree'].unique())

Valores unicos
['2. High School' '0. None' '4. Bachelors' '3. Associates' '5. Masters'
 '1. GED' '7. Professional' '6. PhD' nan]

In [54]:
print('Frecuencia de valores unicos')
print(df['highestdegree'].value_counts())

Frecuencia de valores unicos
highestdegree
2. High School     3667
4. Bachelors       1673
1. GED             1146
0. None             953
3. Associates       737
5. Masters          603
7. Professional     120
6. PhD               54
Name: count, dtype: int64

In [55]:
import re

In [56]:
df['highestdegree'] = df['highestdegree'].str.lower().str.replace(r'\d+\.' , '', regex=True)
print(df['highestdegree'].value_counts())

highestdegree
high school     3667
bachelors       1673
ged             1146
none             953
associates       737
masters          603
professional     120
phd               54
Name: count, dtype: int64